In [1]:
import numpy as np
import pandas as pd

In [2]:
mathmarks = [90,78,89,71]

In [28]:
phymarks = [80,70,80,90]
names = ['john','tom','hari','robert']

In [29]:
mathser = pd.Series(mathmarks,index=['john','tom','hari','robert'])
physer=pd.Series(phymarks,index=['tom','john','DKBose','robert'])

In [30]:
total = mathser + physer
total

DKBose      NaN
hari        NaN
john      160.0
robert    161.0
tom       158.0
dtype: float64

In [31]:
total.isna() #checks if there are NaNs or not

DKBose     True
hari       True
john      False
robert    False
tom       False
dtype: bool

In [32]:
total.isna().sum() #returns number of NaNs

2

In [33]:
total.dropna() #drops NaN values

john      160.0
robert    161.0
tom       158.0
dtype: float64

In [34]:
total.fillna(value=0)

DKBose      0.0
hari        0.0
john      160.0
robert    161.0
tom       158.0
dtype: float64

In [36]:
total.fillna(method='ffill') #forward-fill(ffill)

DKBose      NaN
hari        NaN
john      160.0
robert    161.0
tom       158.0
dtype: float64

In [38]:
total.fillna(method='bfill') #before-fill(bfill)

DKBose    160.0
hari      160.0
john      160.0
robert    161.0
tom       158.0
dtype: float64

In [42]:
arr = np.random.randint(low=20,high=31,size=(6,3))

In [43]:
arr

array([[25, 27, 21],
       [29, 21, 29],
       [28, 21, 22],
       [27, 24, 24],
       [29, 20, 21],
       [23, 26, 26]])

In [45]:
df=pd.DataFrame(arr,columns=['col1','col2','col3'])

In [46]:
df

   col1  col2  col3
0    25    27    21
1    29    21    29
2    28    21    22
3    27    24    24
4    29    20    21
5    23    26    26

In [47]:
df['col1']

0    25
1    29
2    28
3    27
4    29
5    23
Name: col1, dtype: int64

In [48]:
df[['col1','col2']] #access a particular column

   col1  col2
0    25    27
1    29    21
2    28    21
3    27    24
4    29    20
5    23    26

In [52]:
df[0:3]

   col1  col2  col3
0    25    27    21
1    29    21    29
2    28    21    22

In [57]:
df.loc[2,'col2'] #loc stands for location

21

In [58]:
df.iloc[2,1]

21

In [61]:
mathser = pd.Series(mathmarks,index=['john','tom','hari','robert'])
physer=pd.Series(phymarks,index=['tom','john','DKBose','robert'])
chemser=pd.Series([80,np.NaN,89,90],index=['john','tom','steve','robert'])

In [63]:
d = {'math':mathser,'phy':physer,'chem':chemser}

In [66]:
df=pd.DataFrame(d)
df

        math   phy  chem
DKBose   NaN  80.0   NaN
hari    89.0   NaN   NaN
john    90.0  70.0  80.0
robert  71.0  90.0  90.0
steve    NaN   NaN  89.0
tom     78.0  80.0   NaN

In [67]:
df['math'].mean()

82.0

In [71]:
df.mean(axis=1,skipna=False)

DKBose          NaN
hari            NaN
john      80.000000
robert    83.666667
steve           NaN
tom             NaN
dtype: float64

In [72]:
df.mean(axis=0,skipna=False)

math   NaN
phy    NaN
chem   NaN
dtype: float64